In [5]:
#pandas -- powerful data manupilation tool in python library used for data cleaning and data analysis
#Series(1-D) and Data Frame(2-D)
import pandas as pd

In [ ]:
#panda -- series -- is a 1d array like object that can hold an data type object, similar to a column in a table

#Creating a series from a list
data = [4,3,34,2,25]
srs = pd.Series(data)
print("Series from list\n", srs)
print(type(srs))

In [ ]:
#Creating series from a dictionary elements
d = {'a':32,'b':5,'c':56,'d':43}
srs1 = pd.Series(d)
print("Series from Dictionary\n",srs1)
print(type(srs1))

In [ ]:
data_lis = [23,32,7,86,88,36]
index_ = ['e','f','a','r','t','r']
srs3 = pd.Series(data_lis,index=index_)
print("Series with custom indexes \n",srs3)

In [ ]:
#Pandas -- Data Frame -- 2d -- mutable, hetrogenous tabler data structured with label axes(rows and columns), similar to table in a db/excel


#Dataframe

#Create a Dataframe with a dictionary of list
dList = {
    'studentId':['s1','s2','s3','s4'],
    'Name':['John','Jack','Labushane','Steve'],
    'Age':[34,12,23,26],
    'address':['Parker Street','root Street','broad Street','Smith Street'],
    'isMobile':[True,False,False,True]
         }

df_dList = pd.DataFrame(dList)
print(df_dList)
print(type(df_dList))

In [ ]:
#Create a DF from list of dictionaries
li_Dict = [
    {'name':'jack','age':23,'isMobile':True},
    {'name':'Pop','age':12,'isMobile':False},
    {'name':'root','age':31,'isMobile':True},
    {'name':'broad','age':43,'isMobile':False}
]

df_li_Dict = pd.DataFrame(li_Dict)
print(df_li_Dict)
print(type(df_li_Dict))

In [ ]:
df1 = pd.read_csv('data.csv')
df1.head(7)
df1.tail(5)

In [6]:
#accessing data from data frame
dList = {
    'studentId':['s1','s2','s3','s4'],
    'Name':['John','Jack','Labushane','Steve'],
    'Age':[34,12,23,26],
    'address':['Parker Street','root Street','broad Street','Smith Street'],
    'isMobile':[True,False,False,True]
         }

df_dList = pd.DataFrame(dList)
print("Entire Data Frame is of data type : ",type(df_dList))

nameColumn = df_dList['Name']
print("Accessing one column then data type becomes:",type(nameColumn))

Entire Data Frame is of data type :  <class 'pandas.core.frame.DataFrame'>
Accessing one column then data type becomes: <class 'pandas.core.series.Series'>

In [ ]:
df_dList.loc[1]

In [ ]:
df_dList.iloc[1]

In [7]:

df_dList

  studentId       Name  Age        address  isMobile
0        s1       John   34  Parker Street      True
1        s2       Jack   12    root Street     False
2        s3  Labushane   23   broad Street     False
3        s4      Steve   26   Smith Street      True

In [8]:
#accessing a specified element
df_dList.at[1,'studentId']

's2'

In [9]:
#accessing a specified element
df_dList.at[2,'address']

'broad Street'

In [12]:
#accessing a sepcified element using iat
df_dList.iat[2,1]

'Labushane'

In [13]:
df_dList

  studentId       Name  Age        address  isMobile
0        s1       John   34  Parker Street      True
1        s2       Jack   12    root Street     False
2        s3  Labushane   23   broad Street     False
3        s4      Steve   26   Smith Street      True

In [15]:
#data manipulation with data frames

#adding a new column
df_dList['scholarship'] = [3423,3265,4536,3454]
df_dList

  studentId       Name  Age        address  isMobile  scholarship
0        s1       John   34  Parker Street      True         3423
1        s2       Jack   12    root Street     False         3265
2        s3  Labushane   23   broad Street     False         4536
3        s4      Steve   26   Smith Street      True         3454

In [21]:
#Remove a Column

#by default axis is 0, it checks for the row axis(axis = 0)
#axis=1 ---> check the column axis

df_dList.drop('scholarship',axis=1)

  studentId       Name  Age        address  isMobile
0        s1       John   34  Parker Street      True
1        s2       Jack   12    root Street     False
2        s3  Labushane   23   broad Street     False
3        s4      Steve   26   Smith Street      True

In [22]:
df_dList
print("\n\n\n\n\n")
print("In actual drop didn't altered the data frame, since drop is not a permenant is action alone, we should use inplace=True")

  studentId       Name  Age        address  isMobile  scholarship
0        s1       John   34  Parker Street      True         3423
1        s2       Jack   12    root Street     False         3265
2        s3  Labushane   23   broad Street     False         4536
3        s4      Steve   26   Smith Street      True         3454

In [23]:
df_dList.drop('scholarship',axis=1,inplace=True)
df_dList

  studentId       Name  Age        address  isMobile
0        s1       John   34  Parker Street      True
1        s2       Jack   12    root Street     False
2        s3  Labushane   23   broad Street     False
3        s4      Steve   26   Smith Street      True

In [26]:
df_dList['Age'] = df_dList['Age'] +1
df_dList

  studentId       Name  Age        address  isMobile
0        s1       John   35  Parker Street      True
1        s2       Jack   13    root Street     False
2        s3  Labushane   24   broad Street     False
3        s4      Steve   27   Smith Street      True

In [27]:
df_dList.drop(0)

  studentId       Name  Age       address  isMobile
1        s2       Jack   13   root Street     False
2        s3  Labushane   24  broad Street     False
3        s4      Steve   27  Smith Street      True

In [28]:
df_dList

  studentId       Name  Age        address  isMobile
0        s1       John   35  Parker Street      True
1        s2       Jack   13    root Street     False
2        s3  Labushane   24   broad Street     False
3        s4      Steve   27   Smith Street      True

In [29]:
df_dList.drop(0,inplace=True)

In [30]:
df_dList

  studentId       Name  Age       address  isMobile
1        s2       Jack   13   root Street     False
2        s3  Labushane   24  broad Street     False
3        s4      Steve   27  Smith Street      True

In [39]:
df_dList['Name'][1]='Jack'

C:\Users\santhosh.maredubaku\AppData\Local\Temp\ipykernel_12936\3855651280.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df_dList['Name'][1]='Jack'
C:\Users\santhosh.maredubaku\AppData\Local\Temp\ipykernel_12936\3855651280.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_dList['Name'][1]='Jack'

In [40]:
df_dList

  studentId       Name  Age       address  isMobile
1        s2       Jack   13   root Street     False
2        s3  Labushane   24  broad Street     False
3        s4      Steve   27  Smith Street      True

In [41]:
#attributes
df_dList.head()

  studentId       Name  Age       address  isMobile
1        s2       Jack   13   root Street     False
2        s3  Labushane   24  broad Street     False
3        s4      Steve   27  Smith Street      True

In [42]:
df_data = pd.read_csv("data.csv")
df_data.head(3)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East

In [43]:
#Display the data type of each column
print("Data types :\n",df_data.dtypes)

Data types :
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [44]:
#Stastical Information
print("Stastical Information :\n",df_data.describe())

Stastical Information :
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000